package com.example.elder.ui.data

import com.example.elder.ui.model.StudentUiState

class Repository {
    companion object {
        fun getGroup(key: String): List<StudentUiState> {
            when (key) {
                "GROUP1" -> return group01.map { StudentUiState(it) }
                "GROUP2" -> return group02.map { StudentUiState(it) }
                else -> return group03.map { StudentUiState(it) }
            }
        }

        private val group03 = listOf(
            "Ахмед-Оглы",
            "Букач",
            "Буренко",
            "Гертер",
            "Гусарь",
            "Давоян",
            "Евсиков",
            "Каунов",
            "Коротаева",
            "Кравченко",
            "Куприянов",
            "Куприянова",
            "Мирошников",
            "Низами",
            "Ольховский",
            "Переверзев",
            "Пивнев",
            "Полутина",
            "Розентул",
            "Сапрыкина",
            "Ханцев",
            "Шелехов",
            "Шепилов"
        )

        private val group01 = listOf(
            "Васильев",
            "Гайфуллин",
            "Галась",
            "Глушаков",
            "Дерябкина",
            "Долотов",
            "Егоров",
            "Ивлев",
            "Кириллов",
            "Клеменко",
            "Корепанов",
            "Косников",
            "Котов",
            "Муравьев",
            "Ней",
            "Пруцаков",
            "Стасенко",
            "Степанов",
            "Факхур",
            "Федоренко",
            "Фоменко",
            "Химичева",
            "Чайников",
            "Чернобровкина",
            "Шипулин",
            "Щербина",
            "Яворская"
        )

        private val group02 = listOf(
            "Болотов",
            "Винниченко",
            "Волков",
            "Газизов",
            "Глушков",
            "Григорьев",
            "Гусейнов",
            "Данилов",
            "Денисов",
            "Довгаль",
            "Зароченцев",
            "Жадан",
            "Карими",
            "Криворучко",
            "Кост",
            "Лысенко",
            "Медведев",
            "Панина",
            "Попов",
            "Петрина",
            "Овсепьян",
            "Самойлик",
            "Тищенко",
            "Ткаченко",
            "Харитонов",
            "Черногаев"
        )
    }
}

enum class GROUP_KEYS(
    val key: String
) {
    GROUP01("GROUP1"),
    GROUP02("GROUP2"),
    GROUP03("GROUP3")
}